Revit 2027 API
ElectricalDemandFactorDefinition.RemoveValue Method
 Removes a value to the value set for this demand factor definition
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveValue(
	ElectricalDemandFactorValue dfValue
)
Public Sub RemoveValue (
	dfValue As ElectricalDemandFactorValue
)
public:
void RemoveValue(
	ElectricalDemandFactorValue^ dfValue
)
member RemoveValue :
        dfValue : ElectricalDemandFactorValue -> unit
Parameters
dfValue ElectricalDemandFactorValue
 Value to remove from the set
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace